package ru.htp.liner.main;

public class Main6 {

// 	7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника 

	public static void main(String[] args) {
		double x; // ширина
		double y; // длина
		y = 6;
		x = y / 2;
		System.out.println("Площадь прямоугольника = " + y * x + " кв.м.");

	}

}
