package ru.htp.liner.main;

public class Main14 {

// 15. Написать программу, которая выводит на экран первые четыре степени числа π. 

	public static void main(String[] args) {

		double a;

		System.out.println(Math.PI);
		a = Math.pow(Math.PI, 2);
		System.out.println(a);
		a = Math.pow(Math.PI, 3);
		System.out.println(a);
		a = Math.pow(Math.PI, 4);
		System.out.println(a);

	}

}
